# DimToIntersectingGrids Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimToIntersectingGrids Property
ParameterTypeId Class See Also
---
"Dimension To Intersecting Grids"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimToIntersectingGrids { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimToIntersectingGrids As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimToIntersectingGrids {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace